#define _CRT_SECURE_NO_WARNINGS 1
#include <stdio.h>

#define SWAP_BIT(x) (((0xaaaaaaaa&x) >> 1) | ((0x55555555&x) << 1))

int main() 
{
    // 00000001 00000001 00000010 00000010 00000011 00000011 00000100 00000100
    int x = 0xaaaaaaaa; 
    int swapX = SWAP_BIT(x);
    printf("%p", swapX);
    // 使用 10101010 10101010 10101010 10101010 10101010 10101010 10101010 10101010取出所有的偶数位
    // 十六进制：0xaaaaaaaa
    // 使用 01010101 01010101 01010101 01010101 01010101 01010101 01010101 01010101取出所有的奇数位
    // 十六进制：0x55555555
    // 用按位与的方式取出偶数位，右移一位即得到了新的奇数位
    // 用按位与的方式取出奇数位，左移一位即得到了新的偶数位
    // 

    return 0;
}
